IDEA StatiCa Open Model
ApplyConnTemplateSetting.DefaultConcreteMaterialID Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 ID of the material concrete which will be used as default (it must exists in the project)
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int DefaultConcreteMaterialID { get; set; }
Public Property DefaultConcreteMaterialID As Integer
	Get
	Set
public:
property int DefaultConcreteMaterialID {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
ApplyConnTemplateSetting Class
IdeaRS.OpenModel.Connection Namespace